uhnp/src/Reports/АнализПроцессов/АнализПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализПроцессов</name>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Метрика</name>
    <type>
      <types>EnumRef.МетрикиАнализаПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныеРасшифровки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаСхемаКомпоновки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностиАнализаПроцессов</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/InformationRegisters/ВыполнениеПроцессов/ВыполнениеПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеЭтапа</name>
    <type>
      <types>EnumRef.СостоянияЭтаповУниверсальныхПроцессов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаЭтап</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСогласованныхЭтаповПредшественников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринялКИсполнению</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИсторияВыполненияПроцессов/ИсторияВыполненияПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВыполненияПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыОповещенийПользователейУХ</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийСистемы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьПериодСортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСортировкиМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/МетрикиАнализаПроцессов/МетрикиАнализаПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетрикиАнализаПроцессов</name>
  <enumValues>
    <name>КоличествоОтклонений</name>
  </enumValues>
  <enumValues>
    <name>КонсервативнаяДлительность</name>
  </enumValues>
  <enumValues>
    <name>ДлительностьСредняя</name>
  </enumValues>
  <enumValues>
    <name>ДлительностьПлановая</name>
  </enumValues>
  <enumValues>
    <name>ОтклнениеОтПланаСумма</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтклонения</name>
  </enumValues>
  <enumValues>
    <name>КоличествоВыполнений</name>
  </enumValues>
  <enumValues>
    <name>ДлительностьСумма</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПериодичностиАнализаПроцессов/ПериодичностиАнализаПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностиАнализаПроцессов</name>
  <enumValues>
    <name>Секунды</name>
  </enumValues>
  <enumValues>
    <name>Часы</name>
  </enumValues>
  <enumValues>
    <name>Дни</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОповещенийПользователейУХ/ВидыОповещенийПользователейУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОповещенийПользователейУХ</name>
  <enumValues>
    <name>ИзменениеСостоянияЭкземпляраОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеДокументаНаСогласованиеПоМаршруту</name>
  </enumValues>
  <enumValues>
    <name>ОткрытиеПериода</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПериода</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеЭкземпляраОтчетаНаЕдиноличноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеОтчетаНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеСогласующего</name>
  </enumValues>
  <enumValues>
    <name>УдалениеСогласующего</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеОтчета</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеОтчета</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеОНеобходимостиСогласования</name>
  </enumValues>
  <enumValues>
    <name>ДокументСогласован</name>
  </enumValues>
  <enumValues>
    <name>Ознакомление</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольноеУведомление</name>
  </enumValues>
  <enumValues>
    <name>ЭтапСогласован</name>
  </enumValues>
  <enumValues>
    <name>ЭтапОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ПроцессЗапущен</name>
  </enumValues>
  <enumValues>
    <name>ПроцессОстановлен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленДополнительныйСогласующий</name>
    <comment>В этап согласования был добавлен дополнительный согласующий</comment>
  </enumValues>
  <enumValues>
    <name>УдаленДополнительныйСогласующий</name>
    <comment>Из этапа согласования был удален дополнительный согласующий</comment>
  </enumValues>
  <enumValues>
    <name>ВыбранСледующийЭтап</name>
  </enumValues>
  <enumValues>
    <name>ЭтапПринятКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОтмененоПринятиеЭтапаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭтапПринятКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтмененоПринятиеЭтапаКИсполнению</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияПроцесса/СостоянияПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроцесса</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Остановлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЭкземплярПроцесса/ЭкземплярПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭкземплярПроцесса</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевойОбъектПроцесса</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВыполнения</name>
    <type>
      <types>EnumRef.СостоянияПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцессРодитель</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапРодитель</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючевогоОбъекта</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПроцесса</name>
    <type>
      <types>EnumRef.НазначенияУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеСогласующие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РасширеннаяАдресацияСогласования</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопСогласующий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДелегирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПроцесса</name>
    <attributes>
      <name>КодПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияПараметраСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияПараметраСсылка</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
        <types>CatalogRef.СправочникиБД</types>
        <types>CatalogRef.СчетаБД</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПростойТип</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Reports/АнализПроцессов/ObjectModule.bsl
// Устанавливает выбранные поля в диаграмме с настройками НастройкиВход
// согласно метрике МетрикаВход.
Процедура ВыбратьПолеДиаграммыПоМетрике(НастройкиВход, МетрикаВход)
	ПолеОтклонениеОтПлана = Новый ПолеКомпоновкиДанных("ОтклонениеОтПлана");
	ПолеДлительностьСредняя = Новый ПолеКомпоновкиДанных("ДлительностьСредняя");
	ПолеДлительностьПлановая = Новый ПолеКомпоновкиДанных("ДлительностьПлановая");
	ПолеПроцентОтклонение = Новый ПолеКомпоновкиДанных("ПроцентОтклонения");
	ПолеКонсервативнаяДлительность = Новый ПолеКомпоновкиДанных("КонсервативнаяДлительность");
	ПолеКоличествоОтклонений = Новый ПолеКомпоновкиДанных("КоличествоОтклонений");
	Для Каждого ТекСтруктура Из НастройкиВход.Структура Цикл
		Если ТекСтруктура.Имя = "ДиаграммаАнализ" Тогда
			Для Каждого ТекЭлементы Из ТекСтруктура.Выбор.Элементы Цикл
				Если ТекЭлементы.Поле = ПолеОтклонениеОтПлана Тогда
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ОтклнениеОтПланаСумма);
				ИначеЕсли ТекЭлементы.Поле = ПолеДлительностьСредняя Тогда      
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьСредняя);
				ИначеЕсли ТекЭлементы.Поле = ПолеДлительностьПлановая Тогда
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьПлановая);
				ИначеЕсли ТекЭлементы.Поле = ПолеПроцентОтклонение Тогда
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ПроцентОтклонения);
				ИначеЕсли ТекЭлементы.Поле = ПолеКонсервативнаяДлительность Тогда
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КонсервативнаяДлительность);
				ИначеЕсли ТекЭлементы.Поле = ПолеКоличествоОтклонений Тогда
					ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КоличествоОтклонений);	
				Иначе
					// Выполняем поиск далее.
				КонецЕсли;	
			КонецЦикла;	
		Иначе
			// Не диаграмма. Не выбираем используемое поле.
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры		// ВыбратьПолеДиаграммыПоМетрике()

// Устанавливает сортировку по полю, соответствующему метрике МетрикаВход,
// в СКД с настройками НастройкиВход.
Процедура СортироватьОтчетПоМетрике(НастройкиВход, МетрикаВход)
	ПолеОтклонениеОтПлана = Новый ПолеКомпоновкиДанных("ОтклонениеОтПлана");
	ПолеДлительностьСреднее = Новый ПолеКомпоновкиДанных("ДлительностьСреднее");
	ПолеДлительностьПлановая = Новый ПолеКомпоновкиДанных("ДлительностьПлановая");
	ПолеПроцентОтклонение = Новый ПолеКомпоновкиДанных("ПроцентОтклонение");
	ПолеКонсервативнаяДлительность = Новый ПолеКомпоновкиДанных("КонсервативнаяДлительность");
	ПолеКоличествоОтклонений = Новый ПолеКомпоновкиДанных("КоличествоОтклонений");
	Для Каждого ТекЭлементы Из НастройкиВход.Порядок.Элементы Цикл
		Если ТекЭлементы.Поле = ПолеОтклонениеОтПлана Тогда
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ОтклнениеОтПланаСумма);
		ИначеЕсли ТекЭлементы.Поле = ПолеДлительностьСреднее Тогда      
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьСредняя);
		ИначеЕсли ТекЭлементы.Поле = ПолеДлительностьПлановая Тогда
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьПлановая);
		ИначеЕсли ТекЭлементы.Поле = ПолеПроцентОтклонение Тогда
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ПроцентОтклонения);
		ИначеЕсли ТекЭлементы.Поле = ПолеКонсервативнаяДлительность Тогда
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КонсервативнаяДлительность);
		ИначеЕсли ТекЭлементы.Поле = ПолеКоличествоОтклонений Тогда
			ТекЭлементы.Использование = (МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КоличествоОтклонений);
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры		// СортироватьОтчетПоМетрике()

// Возвращает исходную таблицу аналитики от ДатаНачалаВход до ДатаОкончанияВход
// по организации ОрганизацияВход.
Функция ПолучитьТаблицуАналитики(ДатаНачалаВход, ДатаОкончанияВход, ОрганизацияВход, ПериодичностьВход = Неопределено) Экспорт
	РезультатФункции = Новый ТаблицаЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыполнениеПроцессов.ЭтапПроцесса КАК ЭтапПроцесса,
		|	ВыполнениеПроцессов.ДатаНачала КАК ДатаНачала,
		|	ВыполнениеПроцессов.ДатаОкончания КАК ДатаОкончания,
		|	ВыполнениеПроцессов.ДокументПроцесса.Организация КАК Организация,
		|	ВыполнениеПроцессов.ЭтапПроцесса.Владелец КАК ШаблонПроцесса,
		|	ВыполнениеПроцессов.ДокументПроцесса КАК ДокументПроцесса,
		|	ВыполнениеПроцессов.Автор КАК Автор
		|ПОМЕСТИТЬ ВТ_ДанныеРегистра
		|ИЗ
		|	РегистрСведений.ВыполнениеПроцессов КАК ВыполнениеПроцессов
		|ГДЕ
		|	ВыполнениеПроцессов.Период >= &ДатаНачала
		|	И ВыполнениеПроцессов.Период <= &ДатаОкончания
		|	И ВыполнениеПроцессов.ДатаНачала <> &ПустаяДата
		|	И ВыполнениеПроцессов.ДатаОкончания <> &ПустаяДата
		|	И ВыполнениеПроцессов.ДокументПроцесса.СостояниеВыполнения <> &СостояниеВРаботе
		|	И НЕ ВыполнениеПроцессов.ЭтапПроцесса.ПометкаУдаления
		|	И ВыполнениеПроцессов.ДокументПроцесса.Организация В ИЕРАРХИИ(&Организация)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыполнениеПроцессов.ЭтапПроцесса,
		|	ВыполнениеПроцессов.ДатаНачала,
		|	ВыполнениеПроцессов.ДатаОкончания,
		|	ВыполнениеПроцессов.ДокументПроцесса.Организация,
		|	ВыполнениеПроцессов.ЭтапПроцесса.Владелец,
		|	ВыполнениеПроцессов.ДокументПроцесса,
		|	ВыполнениеПроцессов.Автор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияВыполненияПроцессов.ДокументПроцесса КАК ДокументПроцесса,
		|	МИНИМУМ(ИсторияВыполненияПроцессов.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПериодыОтклонения
		|ИЗ
		|	РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
		|ГДЕ
		|	ИсторияВыполненияПроцессов.Событие = &СобытиеСогласованиеОтклонено
		|	И НЕ ИсторияВыполненияПроцессов.ЭтапПроцесса.ПометкаУдаления
		|	И ИсторияВыполненияПроцессов.Период >= &ДатаНачала
		|	И ИсторияВыполненияПроцессов.Период <= &ДатаОкончания
		|	И ИсторияВыполненияПроцессов.ДокументПроцесса.Организация В ИЕРАРХИИ(&Организация)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияВыполненияПроцессов.ДокументПроцесса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияВыполненияПроцессов.ЭтапПроцесса КАК ЭтапПроцесса,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсторияВыполненияПроцессов.ИдентификаторСообщения) КАК КоличествоОтклонений,
		|	ИсторияВыполненияПроцессов.ДокументПроцесса КАК ДокументПроцесса
		|ПОМЕСТИТЬ ВТ_Отклонения
		|ИЗ
		|	РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыОтклонения КАК ВТ_ПериодыОтклонения
		|		ПО ИсторияВыполненияПроцессов.Период = ВТ_ПериодыОтклонения.Период
		|			И ИсторияВыполненияПроцессов.ДокументПроцесса = ВТ_ПериодыОтклонения.ДокументПроцесса
		|ГДЕ
		|	ИсторияВыполненияПроцессов.Событие = &СобытиеСогласованиеОтклонено
		|	И НЕ ИсторияВыполненияПроцессов.ЭтапПроцесса.ПометкаУдаления
		|	И ИсторияВыполненияПроцессов.Период >= &ДатаНачала
		|	И ИсторияВыполненияПроцессов.Период <= &ДатаОкончания
		|	И ИсторияВыполненияПроцессов.ДокументПроцесса.Организация В ИЕРАРХИИ(&Организация)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияВыполненияПроцессов.ЭтапПроцесса,
		|	ИсторияВыполненияПроцессов.ДокументПроцесса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДанныеРегистра.ЭтапПроцесса КАК ЭтапПроцесса,
		|	ВТ_ДанныеРегистра.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВТ_ДанныеРегистра.ДатаНачала, ВТ_ДанныеРегистра.ДатаОкончания, СЕКУНДА) КАК Длительность,
		|	ВТ_ДанныеРегистра.ДатаНачала КАК ДатаНачала,
		|	ВТ_ДанныеРегистра.Организация КАК Организация,
		|	ВТ_ДанныеРегистра.ЭтапПроцесса.ДлительностьСогласования * 60 * 60 КАК ДлительностьПлановая,
		|	ВТ_ДанныеРегистра.ШаблонПроцесса КАК ШаблонПроцесса,
		|	ВТ_ДанныеРегистра.ДокументПроцесса КАК ДокументПроцесса,
		|	ВТ_ДанныеРегистра.Автор КАК Автор,
		|	ЕСТЬNULL(ВТ_Отклонения.КоличествоОтклонений, 0) КАК КоличествоОтклонений
		|ПОМЕСТИТЬ ВТ_Длительность
		|ИЗ
		|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отклонения КАК ВТ_Отклонения
		|		ПО ВТ_ДанныеРегистра.ЭтапПроцесса = ВТ_Отклонения.ЭтапПроцесса
		|			И ВТ_ДанныеРегистра.ДокументПроцесса = ВТ_Отклонения.ДокументПроцесса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Длительность.ШаблонПроцесса КАК ШаблонПроцесса,
		|	ВТ_Длительность.ЭтапПроцесса КАК ЭтапПроцесса,
		|	ВТ_Длительность.Организация КАК Организация,
		|	СУММА(ВТ_Длительность.Длительность) КАК ДлительностьСумма,
		|	КОЛИЧЕСТВО(ВТ_Длительность.Длительность) КАК ДлительностьКоличество,
		|	МИНИМУМ(ВТ_Длительность.Длительность) КАК ДлительностьМинимум,
		|	МАКСИМУМ(ВТ_Длительность.Длительность) КАК ДлительностьМаксимум,
		|	СРЕДНЕЕ(ВТ_Длительность.Длительность) КАК ДлительностьСреднее,
		|	МАКСИМУМ(ВТ_Длительность.ДлительностьПлановая) КАК ДлительностьПлановая,
		|	ВТ_Длительность.ШаблонПроцесса.ТипОбъектаСогласования КАК ТипОбъектаСогласования,
		|	ВТ_Длительность.ДокументПроцесса КАК ДокументПроцесса,
		|	ВТ_Длительность.Автор КАК Автор,
		|	СУММА(ВТ_Длительность.КоличествоОтклонений) КАК КоличествоОтклонений
		|ПОМЕСТИТЬ ВТ_Свертка
		|ИЗ
		|	ВТ_Длительность КАК ВТ_Длительность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Длительность.ЭтапПроцесса,
		|	ВТ_Длительность.Организация,
		|	ВТ_Длительность.ШаблонПроцесса,
		|	ВТ_Длительность.ШаблонПроцесса.ТипОбъектаСогласования,
		|	ВТ_Длительность.ДокументПроцесса,
		|	ВТ_Длительность.Автор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свертка.ШаблонПроцесса КАК ШаблонПроцесса,
		|	ВТ_Свертка.ЭтапПроцесса КАК ЭтапПроцесса,
		|	ВТ_Свертка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Секунды)
		|			ТОГДА ВТ_Свертка.ДлительностьСумма / 1
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Часы)
		|			ТОГДА ВТ_Свертка.ДлительностьСумма / (60 * 60)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Дни)
		|			ТОГДА ВТ_Свертка.ДлительностьСумма / (24 * 60 * 60)
		|		ИНАЧЕ ВТ_Свертка.ДлительностьСумма
		|	КОНЕЦ КАК ДлительностьСумма,
		|	ВТ_Свертка.ДлительностьКоличество КАК ДлительностьКоличество,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Секунды)
		|			ТОГДА ВТ_Свертка.ДлительностьМинимум / 1
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Часы)
		|			ТОГДА ВТ_Свертка.ДлительностьМинимум / (60 * 60)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Дни)
		|			ТОГДА ВТ_Свертка.ДлительностьМинимум / (24 * 60 * 60)
		|		ИНАЧЕ ВТ_Свертка.ДлительностьМинимум
		|	КОНЕЦ КАК ДлительностьМинимум,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Секунды)
		|			ТОГДА ВТ_Свертка.ДлительностьМаксимум / 1
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Часы)
		|			ТОГДА ВТ_Свертка.ДлительностьМаксимум / (60 * 60)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Дни)
		|			ТОГДА ВТ_Свертка.ДлительностьМаксимум / (24 * 60 * 60)
		|		ИНАЧЕ ВТ_Свертка.ДлительностьМаксимум
		|	КОНЕЦ КАК ДлительностьМаксимум,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Секунды)
		|			ТОГДА ВТ_Свертка.ДлительностьСреднее / 1
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Часы)
		|			ТОГДА ВТ_Свертка.ДлительностьСреднее / (60 * 60)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Дни)
		|			ТОГДА ВТ_Свертка.ДлительностьСреднее / (24 * 60 * 60)
		|		ИНАЧЕ ВТ_Свертка.ДлительностьСреднее
		|	КОНЕЦ КАК ДлительностьСредняя,
		|	ВЫБОР
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Секунды)
		|			ТОГДА ВТ_Свертка.ДлительностьПлановая / 1
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Часы)
		|			ТОГДА ВТ_Свертка.ДлительностьПлановая / (60 * 60)
		|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиАнализаПроцессов.Дни)
		|			ТОГДА ВТ_Свертка.ДлительностьПлановая / (24 * 60 * 60)
		|		ИНАЧЕ ВТ_Свертка.ДлительностьПлановая
		|	КОНЕЦ КАК ДлительностьПлановая,
		|	ВТ_Свертка.ТипОбъектаСогласования КАК ТипОбъектаСогласования,
		|	ВТ_Свертка.ДокументПроцесса КАК ДокументПроцесса,
		|	ВТ_Свертка.Автор КАК Автор,
		|	ВТ_Свертка.КоличествоОтклонений КАК КоличествоОтклонений
		|ИЗ
		|	ВТ_Свертка КАК ВТ_Свертка";
	ПериодичностьРабочая = Перечисления.ПериодичностиАнализаПроцессов.Часы;
	Если ЗначениеЗаполнено(ПериодичностьВход) Тогда
		ПериодичностьРабочая = ПериодичностьВход;
	Иначе
		ПериодичностьРабочая = Перечисления.ПериодичностиАнализаПроцессов.Часы;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаВход);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияВход);
	Запрос.УстановитьПараметр("Организация", ОрганизацияВход);
	Запрос.УстановитьПараметр("Периодичность", ПериодичностьРабочая);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("СобытиеСогласованиеОтклонено", Перечисления.ВидыОповещенийПользователейУХ.ОтклонениеОтчета);
	Запрос.УстановитьПараметр("СостояниеВРаботе", Перечисления.СостоянияПроцесса.Вработе);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = РезультатЗапроса.Выгрузить();
	Возврат РезультатФункции;
КонецФункции		// ПолучитьТаблицуАналитики()

// Возвращает полную исходную таблицу с данными по выполнению процессов
// по шаблону ШаблонПроцессаВход в периоде от ДатаНачалаАнализаВход
// до ДатаОкончанияАнализаВход с отбором по группе организаций ОрганизацияВход. 
Функция ПолучитьРазвернутыеДанныеПоПроцессам(ШаблонПроцессаВход, ДатаНачалаАнализаВход, ДатаОкончанияАнализаВход, ОрганизацияВход = Неопределено) Экспорт
	РезультатФункции = Новый ТаблицаЗначений;
	Попытка
		ДанныеРасшифровки = Неопределено;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетДокумента = ЭтотОбъект.ПолучитьМакет("МакетИсходныеДанные");
		КомпоновщикАнализ = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикАнализ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(МакетДокумента));
		КомпоновщикАнализ.ЗагрузитьНастройки(МакетДокумента.НастройкиПоУмолчанию);
		КомпоновщикАнализ.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачалаАнализаВход);
		КомпоновщикАнализ.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончанияАнализаВход);
		КомпоновщикАнализ.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ОрганизацияВход);
		КомпоновщикАнализ.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ШаблонПроцесса", ШаблонПроцессаВход);
		НастройкиКомпоновщика = КомпоновщикАнализ.ПолучитьНастройки();
		МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, НастройкиКомпоновщика, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		РезультатФункции = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(РезультатФункции);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось вывести отчет: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьРазвернутыеДанныеПоПроцессам()

// В строке данных СтрокаВход возвращает значение метрики МетрикаВход.
Функция ЗначениеСтрокиПоМетрике(СтрокаВход, МетрикаВход) Экспорт
	РезультатФункции = 0;		
	Если МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьПлановая Тогда
		РезультатФункции = СтрокаВход.ДлительностьПлановая;
	ИначеЕсли МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ОтклнениеОтПланаСумма Тогда
		РезультатФункции = СтрокаВход.ОтклонениеОтПлана;
	ИначеЕсли МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ДлительностьСредняя Тогда
		РезультатФункции = СтрокаВход.ДлительностьСредняя;
	ИначеЕсли МетрикаВход = Перечисления.МетрикиАнализаПроцессов.ПроцентОтклонения Тогда
		РезультатФункции = СтрокаВход.ПроцентОтклонения;		
	ИначеЕсли МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КоличествоВыполнений Тогда
		РезультатФункции = СтрокаВход.ДлительностьКоличество;	
	ИначеЕсли МетрикаВход = Перечисления.МетрикиАнализаПроцессов.КоличествоОтклонений Тогда
		РезультатФункции = СтрокаВход.КоличествоОтклонений;				
	Иначе
		РезультатФункции = 0;
	КонецЕсли;
	Возврат РезультатФункции;		
КонецФункции		// ЗначениеСтрокиПоМетрике()

// Возвращает структуру, содержащую минимальное, максимальное и коридор разброса
// метрики МетрикаВход в таблице ТаблицаВход.
Функция СтруктураГраницМетрикиВТаблице(ТаблицаВход, МетрикаВход)
	РезультатФункции = Новый Структура;
	МинимальноеЗначениеМетрики = 999999;
	МаксимальноеЗначениеМетрики = -999999;
	Для Каждого ТекТаблицаВход Из ТаблицаВход Цикл
		ТекЗначениеМетрики = ЗначениеСтрокиПоМетрике(ТекТаблицаВход, МетрикаВход);
		Если ТекЗначениеМетрики < МинимальноеЗначениеМетрики Тогда
			МинимальноеЗначениеМетрики = ТекЗначениеМетрики;
		Иначе
			// Продолжаем поиск.
		КонецЕсли;
		Если ТекЗначениеМетрики > МаксимальноеЗначениеМетрики Тогда
			МаксимальноеЗначениеМетрики = ТекЗначениеМетрики;
		Иначе
			// Продолжаем поиск.
		КонецЕсли;
	КонецЦикла;
	Коридор = МаксимальноеЗначениеМетрики - МинимальноеЗначениеМетрики;
	РезультатФункции.Вставить("МинимальноеЗначение", МинимальноеЗначениеМетрики);
	РезультатФункции.Вставить("МаксимальноеЗначение", МаксимальноеЗначениеМетрики);
	РезультатФункции.Вставить("Коридор", Коридор);
	Возврат РезультатФункции;
КонецФункции		// СтруктураГраницМетрикиВТаблице()

// Добавляет и вычисляет поля ДлительностьСредняя и ПроцентОтклонения 
// в таблицу ТаблицаВход.
Функция РассчитатьВычисляемыеПоляАнализа(ТаблицаВход)
	РезультатФункции = ТаблицаВход.Скопировать();
	РезультатФункции.Колонки.Добавить("ДлительностьСредняя");
	РезультатФункции.Колонки.Добавить("ПроцентОтклонения");
	Для Каждого ТекТаблицаАнализа Из РезультатФункции Цикл
		Если ТекТаблицаАнализа.ДлительностьКоличество <> 0 Тогда
			ТекТаблицаАнализа.ДлительностьСредняя = ТекТаблицаАнализа.ДлительностьСумма / ТекТаблицаАнализа.ДлительностьКоличество;
		Иначе
			ТекТаблицаАнализа.ДлительностьСредняя = 0;
		КонецЕсли;
		Если ТекТаблицаАнализа.ДлительностьПлановая <> 0 Тогда
			ТекТаблицаАнализа.ПроцентОтклонения = 100 * ТекТаблицаАнализа.ОтклонениеОтПлана / ТекТаблицаАнализа.ДлительностьПлановая;
		Иначе
			ТекТаблицаАнализа.ПроцентОтклонения = 0;
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		// РассчитатьВычисляемыеПоляАнализа()

// Возвращает таблицу распределения количества процессов по метрике МетрикаВход
// в периоде с ДатаНачалаАнализаВход по ДатаОкончанияАнализаВход для организации
// ОрганизацияВход.
Функция ВернутьТаблицуРаспределенияПоТаблицеАнализа(ТаблицаАнализаВход, МетрикаВход) Экспорт
	// Инициализация.
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("ВерхняяГраница");
	РезультатФункции.Колонки.Добавить("ЗначениеСумма");
	РезультатФункции.Колонки.Добавить("ИдентификаторПромежутка");
	РезультатФункции.Колонки.Добавить("Метрика");
	РезультатФункции.Колонки.Добавить("НижняяГраница");
	РезультатФункции.Колонки.Добавить("ПредставлениеПромежутка");
	РезультатФункции.Колонки.Добавить("СортировкаПромежутков");
	Попытка
		ТаблицаАнализаРабочая = ТаблицаАнализаВход.Скопировать();
		ТаблицаАнализаРабочая.Свернуть("Класс, НижняяГраница, ВерхняяГраница", "ЗначениеСумма");
		// Заполнение итоговой таблицы.
		Для Каждого ТекТаблицаАнализаРабочая Из ТаблицаАнализаРабочая Цикл
			// Вычисление дополнительных полей.
			НижняГраницаПредставление			 = Формат(ТекТаблицаАнализаРабочая.НижняяГраница, "ЧДЦ=0; ЧН=0");
			ВерхняяГраницаПредставление = Формат(ТекТаблицаАнализаРабочая.ВерхняяГраница, "ЧДЦ=0; ЧН=0");
			НовоеПредставлениеПромежутка = "[" + НижняГраницаПредставление + "; " + ВерхняяГраницаПредставление + "]";
			// Вставка значений в таблицы.
			НоваяСтрока = РезультатФункции.Добавить();
			НоваяСтрока.Метрика					 = МетрикаВход;
			НоваяСтрока.ПредставлениеПромежутка	 = НовоеПредставлениеПромежутка;
			НоваяСтрока.СортировкаПромежутков	 = ТекТаблицаАнализаРабочая.Класс;
			НоваяСтрока.ЗначениеСумма			 = ТекТаблицаАнализаРабочая.ЗначениеСумма;
			НоваяСтрока.НижняяГраница			 = ТекТаблицаАнализаРабочая.НижняяГраница;
			НоваяСтрока.ВерхняяГраница			 = ТекТаблицаАнализаРабочая.ВерхняяГраница;
			НоваяСтрока.ИдентификаторПромежутка	 = Строка(Новый УникальныйИдентификатор);
		КонецЦикла;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось вывести отчет: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции		// ВернутьТаблицуРаспределенияПоИзмерениям()

// Выполняет анализ таблицы ТаблицаВход и возвращает таблицу
// экземпляров процессов, распределеённых по классам.
Функция ПроанализироватьРаспределениеМетрик(ТаблицаВход, МетрикаВход) Экспорт
	КоличествоПромежутков = 10;
	// Свёртка по метрикам.
	РезультатФункции = ТаблицаВход.Скопировать();
	РезультатФункции.Свернуть("ДокументПроцесса, ЭтапПроцесса", "ДлительностьКоличество, ДлительностьПлановая, ДлительностьСумма, ОтклонениеОтПлана, КоличествоОтклонений");
	РезультатФункции.Колонки.Добавить("Класс");
	РезультатФункции.Колонки.Добавить("ЗначениеСумма");
	РезультатФункции.Колонки.Добавить("НижняяГраница");
	РезультатФункции.Колонки.Добавить("ВерхняяГраница");
	Если РезультатФункции.Количество() > 0 Тогда
		РезультатФункции = РассчитатьВычисляемыеПоляАнализа(РезультатФункции);
		// Определение границ метрики.
		СтруктураГраниц = СтруктураГраницМетрикиВТаблице(РезультатФункции, МетрикаВход);
		МинимальноеЗначениеМетрики = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураГраниц, "МинимальноеЗначение", 0);
		Коридор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураГраниц, "Коридор", 0);
		ЕдиничныйПромежуток = Коридор / КоличествоПромежутков;
		// Классификация значений метрики.
		Если Коридор <> 0 Тогда
			Для Каждого ТекТаблицаАнализа Из РезультатФункции Цикл
				ТекЗначениеМетрики = ЗначениеСтрокиПоМетрике(ТекТаблицаАнализа, МетрикаВход);
				РазницаСМинимальным = ТекЗначениеМетрики - МинимальноеЗначениеМетрики;
				НовыйКласс = Цел(РазницаСМинимальным / ЕдиничныйПромежуток);
				ТекТаблицаАнализа.Класс = НовыйКласс;
				ТекТаблицаАнализа.ЗначениеСумма = 1;
				ТекТаблицаАнализа.НижняяГраница = МинимальноеЗначениеМетрики + Цел(НовыйКласс*ЕдиничныйПромежуток);
				ТекТаблицаАнализа.ВерхняяГраница = МинимальноеЗначениеМетрики + Цел((НовыйКласс + 1)*ЕдиничныйПромежуток);
			КонецЦикла;
		Иначе
			// Промежуток нулевой. Считаем все классы пустыми.
			Для Каждого ТекТаблицаАнализа Из РезультатФункции Цикл
				ТекТаблицаАнализа.Класс = 0;
				ТекТаблицаАнализа.ЗначениеСумма = 1;
				ТекТаблицаАнализа.НижняяГраница = 0;
				ТекТаблицаАнализа.ВерхняяГраница = 0;
			КонецЦикла;
		КонецЕсли;	
		// Добавляем пустые значений для каждого класса.
		ПустойЭкземплярПроцесса = Документы.ЭкземплярПроцесса.ПустаяСсылка();
		Для Счетчик = 0 По КоличествоПромежутков Цикл
			НоваяСтрока = РезультатФункции.Добавить();
			НоваяСтрока.ВерхняяГраница		 = МинимальноеЗначениеМетрики + Цел((Счетчик + 1)*ЕдиничныйПромежуток);
			НоваяСтрока.ДокументПроцесса	 = ПустойЭкземплярПроцесса;
			НоваяСтрока.ЗначениеСумма		 = 0;
			НоваяСтрока.Класс				 = Счетчик;
			НоваяСтрока.НижняяГраница		 = МинимальноеЗначениеМетрики + Цел(Счетчик*ЕдиничныйПромежуток);
		КонецЦикла;
		РезультатФункции.Свернуть("ДокументПроцесса, Класс, НижняяГраница, ВерхняяГраница", "ЗначениеСумма");
	Иначе
		// Исходные данные пустые. Вернём пустую таблицу.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПроанализироватьРаспределениеМетрик()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		// Инициализация.
		МетрикаРабочая = Перечисления.МетрикиАнализаПроцессов.ДлительностьСредняя;
		Если ЗначениеЗаполнено(Метрика) Тогда
			МетрикаРабочая = Метрика;
		Иначе
			МетрикаРабочая = Перечисления.МетрикиАнализаПроцессов.ДлительностьСредняя;
		КонецЕсли;
		// Получение СКД.
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетДокумента = ПолучитьМакет("МакетАнализПоОрганизациям");
		// Установка параметров.
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Метрика", МетрикаРабочая);
		// Настройка таблицы и диаграммы.
		НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
		ВыбратьПолеДиаграммыПоМетрике(НастройкиКомпоновщика, МетрикаРабочая);
		СортироватьОтчетПоМетрике(НастройкиКомпоновщика, МетрикаРабочая);
		МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, НастройкиКомпоновщика, ДанныеРасшифровки);
		// Вывод табличного документа.
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		СтруктураВнешниеНаборы = Новый Структура;
		ТабАнализ = ПолучитьТаблицуАналитики(ДатаНачалаАнализа, ДатаОкончанияАнализа, ОтборОрганизация, Периодичность); 
		Если ТабАнализ.Количество() > 0 Тогда
			СтруктураВнешниеНаборы.Вставить("ТЗ_Анализ", ТабАнализ);
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, СтруктураВнешниеНаборы, ДанныеРасшифровки);
			ДокументРезультат.Очистить();
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			// Настройка табличного документа.
			ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);
			// Сохранение расшифровки.
			АдресХранилищаДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор);
			АдресХранилищаСхемаКомпоновки = ПоместитьВоВременноеХранилище(МакетДокумента, Новый УникальныйИдентификатор); 
		Иначе
			ДокументРезультат.Очистить();
			АдресХранилищаДанныеРасшифровки = "";
			АдресХранилищаСхемаКомпоновки = "";
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось вывести отчет: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры
